import Table from '@/components/Table';
import TitleBox from '@/components/TitleBox';

export default function Page() {
  const rows = [
    ['1', '첫번쨰 문의입니다', '2024-04-05'],
    ['2', '두번쨰 문의입니다', '2024-04-05'],
    ['1', '첫번쨰 문의입니다', '2024-04-05'],
    ['2', '두번쨰 문의입니다', '2024-04-05'],
    ['1', '첫번쨰 문의입니다', '2024-04-05'],
    ['2', '두번쨰 문의입니다', '2024-04-05'],
    ['1', '첫번쨰 문의입니다', '2024-04-05'],
    ['2', '두번쨰 문의입니다', '2024-04-05'],
    ['1', '첫번쨰 문의입니다', '2024-04-05'],
    ['2', '두번쨰 문의입니다', '2024-04-05'],
    ['1', '첫번쨰 문의입니다', '2024-04-05'],
    ['2', '두번쨰 문의입니다', '2024-04-05'],
    ['1', '첫번쨰 문의입니다', '2024-04-05'],
    ['2', '두번쨰 문의입니다', '2024-04-05'],
    ['1', '첫번쨰 문의입니다', '2024-04-05'],
    ['2', '두번쨰 문의입니다', '2024-04-05'],
  ];
  return (
    <div className="h-screen">
      <TitleBox title="문의내역" />
      <Table
        headers={[
          { label: '번호', width: '100px' },
          { label: '제목', width: '900px' },
          { label: '등록 날짜', width: '200px' },
        ]}
        rows={rows}
      />
    </div>
  );
}
